
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2018 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : AD.c */
/* Function : */
/* Ver: 0.01  */
/* History:YYYY.MM.DD Version author Description  
            2018.04.20 V1.0 @Ahren   New File*/
/*-------------------------------------------------------------*/

/***************头文件****************/
/**/
#include "ad.h"
/*************************************/

/******************宏定义*************/
/**/

/*************************************/

/*************************************/

/***************标志位申明************/
/**/

/*************************************/

/***************函数申明**************/
/**/

/*************************************/

/*************************************************************************/
//函数名:Sys_AD_Function_Init
//功  能:系统模数模块初始化
//参  数:无
//返回值:无
//时间:  20180420   
//创建者:arhen 
/************************************************************************/
void Sys_AD_Function_Init(void)
{
	ANCON0=0x00;				//AN4设置为模拟口，其余设置为数字I/O口                                
	ANCON1=0x00;				//AN9设置为模拟口，其余设置为数字I/O口
	//ADCON1=0x20;				//选择来自 ECCP1 的特殊事件触发信号
                                //选择内部基准 VREF+ （ 2.048V）
    //ADCON1 = 0x30;            //4.096
    ADCON1 = 0x00;              //AVDD
                                // A/D VREF- 配置位0 = AVSS
	ADCON2=0x91;				//右对齐、A/D 采集时间 4*TAD 、A/D 转换时钟FOSC/8
								//4M时钟需用F0sc/8, 最佳2us								
	CTMUCONH = 0x00;
}

/*************************************************************************/
//函数名:Get_Analog_Digital_Value
//功  能:采集AD值函数
//参  数:无
//返回值:Collect_AD_Value
//时间:  20180420   
//创建者:arhen 
/************************************************************************/
int Get_Analog_Digital_Value(u8 AD_Ch)
{
	uint16 Collect_AD_Value = 0;	
	
	ADCON0 = (AD_Ch << 2);		  //选择通道
	ADON = 1;                 	  //转换器开始工作
	
	NOP();
	NOP();					 	  //实际确认是否需要
	
	DONE = 1;					  //开启AD转换周期
	while(DONE);				  //等待转换完成
	
    //取高8位,高4位无效,右对齐时使用
	Collect_AD_Value = (ADRESH&0x0f);			
    //取12位时，右对齐时使用
	Collect_AD_Value=(((Collect_AD_Value<<8)&0xff00)|ADRESL);		
	
	ADIF=0;
	NOP();       				//空操作延时 根据实际效果选择是否需要
	NOP();     					 //空操作延?	
						
	return Collect_AD_Value;
}