
/*------------------------------------------------------------------*/
/* FileName : ccp.c */
/* Function : CCP4 Output 1KHZ For Fireout_EN2,Use*/
/*			  Use The CCP4 Interrupt Function*/	
/* Ver. 001 */
/* MP_Ahren NewFile 2016.10.09 */
/* History: */
/*------------------------------------------------------------------*/

/***************头文件****************/
/**/
#include"ccp.h"
/*************************************/

/******************宏定义*************/
/**/

/*************************************/

/*************************************/

/***************标志位申明************/
/**/
//uint16 Period_Val_g = 1000;		   /*1KHZ*/
uint16 Period_Val_g = 200;             /*5KHZ*/
//uint16 Period_Val_g = 142;          /*12KHZ*/	
/*************************************/

/***************函数申明**************/
/**/

/*************************************/
/*************************************************************************/
//函数名:CCP3_C_Inint()
//功  能:CCP3 比较器功能初始化
//参  数:无
//返回值:无
//时间：20171123
//创建者：ahren
/************************************************************************/	
void CCP3_Comparer_Inint(void)
{
	CCP3MD = 0;										//开启CCP3 模块
	CCP3CON = 0x0B;									//比较模式：匹配时输出电平翻转 （ CCPxIF 位置 1）
	C3TSEL = 1;										//基于TMR3 定时器选择
	CCPR3L = (Period_Val_g>>1)&0x00FF; 		 		//获得半周期低8位
	CCPR3H = ((Period_Val_g>>1)>>8)&0x00FF; 		//把半周期高8位移位到低8位	    
}

/*************************************************************************/
//函数名:CCP4_C_Inint()
//功  能:CCP4 比较器功能初始化
//参  数:无
//返回值:无
//时间：20171123
//创建者：ahren
/************************************************************************/	
void CCP4_Comparer_Inint(void)
{
	CCP4MD = 0;										//开启CCP4 模块
	CCP4CON = 0x0B;									//比较模式：匹配时输出电平翻转 （ CCPxIF 位置 1）
	C4TSEL = 1;										//基于TMR3 定时器选择
	CCPR4L = (Period_Val_g>>1)&0x00FF; 		 		//获得半周期低8位
	CCPR4H = ((Period_Val_g>>1)>>8)&0x00FF; 		//把半周期高8位移位到低8位	    
}
