/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : delay.c */
/* Function : */
/* Ver: 0.01  */
/* MP_Ahren NewFile */
/* History:YYYY.MM.DD Version author Description 
          :2017.12.04 0.01 @huajifeng Follow the coding standard  */
/*-------------------------------------------------------------*/

/***************头文件****************/
/**/
/*************************************/
#include"delay.h"

//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/


/*************************************************************************/
//函数名:delay_10ms
//功  能:以10ms为基数进行延时
//参  数:
/************************************************************************/

void delay_10ms(unsigned int Count)
{
	int Temp = 0;      
	         									//定义循环变量
	for(;Count>0; Count--)
	{
		for(Temp=835; Temp>0; Temp--)  		 	//循环次数控制
    	{
	    	NOP();           			    	//消耗一个指令周期的时间
    	}	
	}
}

/*************************************************************************/
//函数名:delay_10us
//功  能:以10us为基数进行延时
//参  数:
/************************************************************************/
void delay_10us(unsigned int Count)
{
		for(; Count>0; Count--)   				//循环次数控制
    	{
	    	NOP();             				   //消耗一个指令周期的时间
    	}	
}
