
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : INT.c */
/* New File Date:2017.11.03 */
/* Function : power det (BU/ACC/Sleep)*/
/* Ver:001 */
/* Author:MP_Ahren*/
/* History:YYYY.MM.DD Version Author Description */
/* */
/*-------------------------------------------------------------*/


/***************头文件****************/
/**/
/*************************************/

#include"int.h"

//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/

static void INT0_Init(void);			//外部中断0初始化函数
static void INT1_Init(void);			//外部中断1初始化函数
static void INT2_Init(void);			//外部中断2初始化函数
static void INT3_Init(void);			//外部中断3初始化函数

/*************************************/

/************相关寄存器说明**********/

/*-----------------------------------
  | Register  | Enable | Disable|
  -----------------------------------
  | INTnIE    |   1    |    0   |  
  -----------------------------------*/
  
/*-----------------------------------  
  | Register  | Rising | Falling|
  -----------------------------------
  | INTnIE    |   1    |    0   |  
  -----------------------------------*/

/************相关寄存器说明**********/
  
//*******************************************/
//函数名:All_INT_Init
//功  能:所有外部中断初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
 void All_INT_Init(void)
 {
 	INT0_Init();			//调用外部中断0初始化函数
 	
  	INT1_Init();			//调用外部中断1初始化函数
  	
  	INT2_Init(); 			//调用外部中断2初始化函数
  		
  	INT3_Init();			//调用外部中断3初始化函数 	
 }
 
/********************************************/
//函数名:INT0_Init
//功  能:外部中断0初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void INT0_Init(void)
{
    INT0IE  = 1;					//关闭外部中断0
    INTEDG0 = 0;				 	//下降沿触发外部中断0  
}

/********************************************/
//函数名:INT1_Init
//功  能:外部中断1初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void INT1_Init(void)
{
    INT1IE  = 0;					//关闭外部中断1
    //INTEDG1 = 0;				 	//下降沿触发外部中断2 
    INTEDG1 = 1;				 	//上升沿触发外部中断2 
}


/********************************************/
//函数名:INT2_Init
//功  能:外部中断2初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void INT2_Init(void)
{
    INT2IE  = 1;					//关闭外部中断2
    INTEDG2 = 0;				 	//下降沿触发外部中断2 
}

/********************************************/
//函数名:INT3_Init
//功  能:外部中断3初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void INT3_Init(void)
{
    INT3IE  = 0;					//外部中断3
    INTEDG3 = 0;				 	//下降沿触发外部中断3  
}

/*************************************************/
//函数名:Total_Interruput_Switch
//功  能:中断总开关初始化,包括串口中断
//参  数:
//时  间:20171109
//创建者:ahren
/*************************************************/
void Total_Interruput_Switch(void)
{
  	RC1IE = 1;						//开启串口1接收中断
    TX1IE = 0;
    
  	RC2IE = 0;						//关闭串口2接收中断
    TX2IE = 0;
    
    CCP3IE = 0;               		//开启比较器3中断
    CCP4IE = 0;               		//开启比较器4中断

    CMP1MD = 1;						//禁止比较器 1模块。所有比较器 1寄存器都保持在复位状态且不可写。
    CMP2MD = 1;						//禁止比较器 2模块。所有比较器 2寄存器都保持在复位状态且不可写。
    //CMP3MD = 1;					//禁止比较器 3模块。所有比较器 3寄存器都保持在复位状态且不可写。
    //CMP4MD = 1;					//禁止比较器 4模块。所有比较器 4寄存器都保持在复位状态且不可写。
    
    GIE = 1;						//允许全局中断
    PEIE = 1;						//允许外部中断
    IPEN = 0;    
}
