/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : ISR.c */
/* Function : */
/* Ver: 0.01  */
/* MP_Ahren NewFile */
/* History:YYYY.MM.DD Version author Description 
          :2017.12.04 0.01 @huajifeng Follow the coding standard  */
/*-------------------------------------------------------------*/

/***************头文件****************/
/**/
/*************************************/
#include "isr.h"
/*************************************/

//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/

/*************************************/
u8 Sys_Time_Falg_g = 0x00;				//系统时间基值：5ms

/***************函数申明**************/
/**/
/*************************************/

/*************************************************/
//函数名:Clear_INT_Flag
//功  能:中断标志位清零
//参  数:
//时  间:20171103
//创建者:ahren
/*************************************************/
static void Clear_INT_Flag(void)
{
	/*******************************/
	/*外部中断 INT0*/
	/******************************/				
    if(INT0IE && INT0IF)         			
    {
        INT0IF    = 0;							//INT0 中断标志位清零
        CAN2_RXD_Interrupt_Flag_g = 1;  
    }
    
	/*******************************/
	/*外部中断 INT1*/
	/*******************************/		
    if(INT1IE && INT1IF)          		
    {
        INT1IF = 0;							//INT1 中断标志位清零
    }
    
	/*******************************/
	/*外部中断 INT2*/
	/*******************************/		
    if(INT2IE && INT2IF)   				
    {
        INT2IF = 0;							//INT2 中断标志位清零
    }
    
	/*******************************/
	/*外部中断 INT3*/
	/*******************************/		
    if(INT3IE && INT3IF)   				
    {
        INT3IF = 0;							//INT3 中断标志位清零
    }
}

/*************************************************/
//函数名:Clear_Timer0_Flag
//功  能:清除定时器0标志位
//参  数:
//时  间:20171103
//创建者:ahren
/*************************************************/
static void Clear_Timer0_Flag(void)
{
	/***********************************/
	/*TMR0 中断*/
	/***********************************/
	if(TMR0IE && TMR0IF)
	{
		TMR0IF = 0;		
	}
}

/*************************************************/
//函数名:Clear_Timer1_Flag
//功  能:清除定时器1标志位,并设定定时器的轮训标志位
//参  数:
//时  间:20171103
//创建者:ahren
/*************************************************/
static void Clear_Timer1_Flag(void)
{
    static uint16 time_cnt = 0;
    
	/***********************************/
	/*TMR1 中断*/
	/**********************************/
	if(TMR1IE && TMR1IF)
	{
		TMR1IF = 0;	
		TMR1IE = 0;
#if 0	
        TMR1H=0xEC; 				//Timer1初始值设定5ms---4M	
        TMR1L=0x88;
#endif
        TMR1H=0xD8; 				//Timer1初始值设定5ms---8M	
        TMR1L=0xFD;	

        Sys_Time_Falg_g = 0x01;
        
        //精准计时
        time_cnt++;
        if(time_cnt>=200)//1秒计时
        {
            time_cnt = 0;
            
            if(Mamual_Start == 1)
            {
                TC_C1_R_10Min++;
            }
        }
		TMR1IE = 1;
	}
}

/*************************************************/
//函数名:Clear_Timer2_Flag
//功  能:清除定时器2标志位
//参  数:
//时  间:20171103
//创建者:ahren
/*************************************************/
static void Clear_Timer2_Flag(void)
{
	/*******************************/
	/*TMR2 中断*/
	/******************************/
	if(TMR2IE && TMR2IF)
	{
		TMR2IF = 0;		
	}
}

/*************************************************/
//函数名:Clear_Timer3_Flag
//功  能:清除定时器3标志位
//参  数:
//时  间:20171103
//创建者:ahren
/*************************************************/
static void Clear_Timer3_Flag(void)
{
	/******************************/
	/*TMR3 中断*/
	/*****************************/
	if(TMR3IE && TMR3IF)
	{
		TMR3IF = 0;		
	}
}

/*************************************************/
//函数名:Clear_Timer4_Flag
//功  能:清除定时器3标志位
//参  数:
//时  间:20171110
//创建者:ahren
/*************************************************/
static void Clear_Timer4_Flag(void)
{
	/******************************/
	/*TMR3 中断*/
	/*****************************/
	if(TMR4IE && TMR4IF)
	{
		TMR4IF = 0;		
	}
}

/*************************************************/
//函数名:Clear_CCP4_Flag
//功  能:清除比较器4标志位
//参  数:
//时  间:20180709
//创建者:Bin
/*************************************************/
static void Clear_CCP3_Flag(void)
{		
	if(CCP3IE && CCP3IF)
	{
		CCP3IF = 0;	
	}
}

/*************************************************/
//函数名:Clear_CCP4_Flag
//功  能:清除比较器4标志位
//参  数:
//时  间:20180709
//创建者:Bin
/*************************************************/
static void Clear_CCP4_Flag(void)
{		
	if(CCP4IE && CCP4IF)
	{
		CCP4IF = 0;	
	}
}

/*************************************************/
//函数名:Clear_CAN_Flag
//功  能:清除CAN中断标志位
//参  数:
//时  间:20180605
//创建者:ahren
/*************************************************/
void Clear_CAN_Flag(void)
{
	/***************************************************/
	/*CAN接收 中断*/
	/***************************************************/	
	if(1==RXB0IF)					           //CAN 总线接收中断，优先级最高
	{	
		RXB0IF=0;							
#if 1	
        Get_TC04_CAN_Data();
#endif
	}    
}

/*************************************************/
//函数名:Clear_UART1_Flag
//功  能:清除UART1中断标志位
//参  数:
//时  间:201807018
//创建者:ahren
/*************************************************/
void Clear_UART1_Flag(void)
{ 	
    if(RC1IF && RC1IE)  				
    {   
        ++receive_num;                                                   // 接收到数据的字节数

		Uart_Rece_Data[receive_num-1] = RCREG1;                          //接收到数据的缓冲区
		if(Uart_Rece_Num == receive_num) 	 
		{
			receive_num = 0;                                                 //接收数据位清0
			UART_Rece_Interrupt_Flag_g = 1;
		}        
	    RC1IF = 0;                                      //UART1 中断标志位清0
	    //TX1IF = 0;
	    //TXREG1 = RCREG1;               						                            	             	
    }
}

/*************************************************/
//函数名:Clear_UART2_Flag
//功  能:清除UART2中断标志位
//参  数:
//时  间:201807018
//创建者:ahren
/*************************************************/
void Clear_UART2_Flag(void)
{	
    if(RC2IF && RC2IE)  				
    {    	                                                             	    	    
	    RC2IF=0;                                      //UART2 中断标志位清0
	    //TXREG2 = RCREG2;                 						                            	             	
    }
}

/*************************************************************************/
//函数名:interrupt INT_ISR
//功 能1:系统中断入口函数
//参  数:
//返回值:无
//时间:  20171127    
//创建者:MP_Ahren
//修改者:huajifeng
/***********************************************************************/
void interrupt INT_ISR(void)
{       
 	Clear_INT_Flag();				//调用清除外部中断标志位函数
	
	Clear_Timer0_Flag();			//调用定时器0处理函数
	
	Clear_Timer1_Flag();			//调用定时器1处理函数并设定定时器的轮训标志位
	
	Clear_Timer2_Flag();			//调用定时器2处理函数
	
	Clear_Timer3_Flag();			//调用定时器3处理函数
	
	Clear_Timer4_Flag();			//调用定时器4处理函数
    
    Clear_CCP3_Flag();              //调用比较器3处理函数

    Clear_CAN_Flag();				//调用CAN处理函数	
    
    Clear_CCP4_Flag();              //调用比较器4处理函数

	Clear_UART1_Flag();             //调用串口1中断处理函数
    
    Clear_UART2_Flag();             //调用串口2中断处理函数
}


