
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : led.c */
/* New File Date:2017.11.03 */
/* Function : power det (BU/ACC/Sleep)*/
/* Ver:001 */
/* Author:MP_Ahren*/
/* History:YYYY.MM.DD Version Author Description */
/* */
/*-------------------------------------------------------------*/


/***************头文件****************/
/**/
/*************************************/
#include"led.h"
//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/


/*************************************/


/********************************************/
//函数名:Led_Display_Init
//功  能:Led_Display_Init初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
void Led_Display_Init(void)
{
	LED_Direction = 0;							//设置 I/O 为输出方向
		
	LED_Display   = 1;  						//初始化为高电平	
}

/********************************************/
//函数名:Led_Display_Fuction
//功  能:系统调试LED显示功能
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
void Led_Display_Fuction(void)
{	
    if(Sys_Onesecond_Flag_g)
    {
        Sys_Onesecond_Flag_g = 0x00;
        
        LED_Display =! LED_Display;
    }		
}
