
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : powermode.c */
/* New File Date:2017.11.02 */
/* Function : power det (BU/ACC/Sleep)*/
/* Ver:001 */
/* Author:MP_Ahren*/
/* History:YYYY.MM.DD Version Author Description */
/* */
/*-------------------------------------------------------------*/

/***************头文件****************/
/**/
/*************************************/

#include "sleep.h"

//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/


/*************************************/

/************功耗管理模式*************/

/*-----------------------------------
  |   mode    | IDLEN | SCS1 | SCS0 |
  -----------------------------------
  | Sleep     |   0   |   X  |   X  |
  -----------------------------------
  | PRI_RUN   |   X   |   0  |   0  |
  -----------------------------------
  | SEN_RUN   |   X   |   0  |   1  |
  -----------------------------------
  | RC_RUN    |   X   |   1  |   0  |
  -----------------------------------
  | PRI_IDLE  |   1   |   0  |   0  |
  -----------------------------------
  | SEN_IDLE  |   1   |   0  |   1  |
  -----------------------------------
  | RC_IDLE   |   1   |   1  |   X  |
  -----------------------------------*/
  
/*************************************/

/********************************************/
//函数名:Sleep_Mode_Init
//功  能:Sleep mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void Sleep_Mode_Init(void)
{
	IDLEN  = 0;				//执行SLEEP 指令后器件进入休眠模式
    SCS0   = 0;				//默认主振荡器
    SCS1   = 0;				//默认主振荡器 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:PRI_RUN_Mode_Init
//功  能:PRI_RUN mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void PRI_RUN_Mode_Init(void)
{
	IDLEN  = 0;				//执行SLEEP 指令后器件进入休眠模式
    SCS0   = 0;				//默认主振荡器
    SCS1   = 0;				//默认主振荡器 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:SEC_RUN_Mode_Init
//功  能:SEC_RUN mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void SEC_RUN_Mode_Init(void)
{
	IDLEN  = 0;				//执行SLEEP 指令后器件进入休眠模式
    SCS0   = 1;				//SOSC 振荡器
    SCS1   = 0;				//SOSC 振荡器 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:RC_RUN_Mode_Init
//功  能:RC_RUN mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void RC_RUN_Mode_Init(void)
{
	IDLEN  = 0;				//执行SLEEP 指令后器件进入休眠模式
    SCS0   = 0;				//内部振荡器模块
    SCS1   = 1;				//内部振荡器模块 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:PRI_IDLE_Mode_Init
//功  能:PRI_IDLE mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void PRI_IDLE_Mode_Init(void)
{
	IDLEN  = 1;				//执行SLEEP 指令后器件进入空闲模式
    SCS0   = 0;				//默认主振荡器
    SCS1   = 0;				//默认主振荡器 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:SEC_IDLE_Mode_Init
//功  能:SEC_IDLE mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void SEC_IDLE_Mode_Init(void)
{
	IDLEN  = 1;				//执行SLEEP 指令后器件进入空闲模式
    SCS0   = 1;				//SOSC 振荡器
    SCS1   = 0;				//SOSC 振荡器 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}

/********************************************/
//函数名:RC_IDLE_Mode_Init
//功  能:RC_IDLE mode初始化
//返回值:无 
//时  间:20171102
//创建者:ahren
/*******************************************/
void RC_IDLE_Mode_Init(void)
{
	IDLEN  = 1;				//执行SLEEP 指令后器件进入空闲模式
    SCS0   = 0;				//内部振荡器模块
    SCS1   = 1;				//内部振荡器模块 
    
    REGSLP = 0;				//当激活器件的休眠模式时，稳压器保持在正常模式
    SRETEN = 0;				//稳压器在使能器件休眠模式时开启，并且低功耗模式由REGSLP 控制
}
