
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName : time.c */
/* New File Date:2017.11.03 */
/* Function : power det (BU/ACC/Sleep)*/
/* Ver:001 */
/* Author:MP_Ahren*/
/* History:YYYY.MM.DD Version Author Description */
/* */
/*-------------------------------------------------------------*/


/***************头文件****************/
/**/
/*************************************/
#include"time.h"
//******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/

static void Time0_Init(void);			//定时器0初始化函数
static void Time1_Init(void);			//定时器1初始化函数
static void Time2_Init(void);			//定时器2初始化函数
static void Time3_Init(void);			//定时器3初始化函数
static void Time4_Init(void);			//定时器4初始化函数

/*************************************/

//*******************************************/
//函数名:All_Time_Init
//功  能:所有定时器初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
void All_Time_Init(void)
{
	Time0_Init();		//调用定时器0初始化函数
	
	Time1_Init();		//调用定时器1初始化函数
	
	Time2_Init();		//调用定时器2初始化函数
	
	Time3_Init();		//调用定时器3初始化函数
	
	Time4_Init();		//调用定时器4初始化函数
}

//*******************************************/
//函数名:Time0_Init
//功  能:定时器0初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void Time0_Init(void)
{
	/***************Timer0 设置****************************/
	/*作为系统定时唤醒定时器*/
	/*16 Bit 定时器初值计算公式：X = 65536 - t /（T x P）*/
	/*X :计数初值*/
	/*t :设定定时时间*/
	/*T :指令周期（4MHZ，T=1us)*/
	/*P :分频比率*/
	/******************************************************/	
	T08BIT = 0;					//16位定时器
	T0CS = 0;
	PSA = 0;					//未分频
	
	T0PS0 = 1;
	T0PS1 = 1;
	T0PS2 = 1;					//1:256分频			

	TMR0H=0xB3; 				//Timer0 初始值 设定5s	
	TMR0L=0xB4;		
	
	TMR0ON=0;					//关闭 Timer0 模块
	TMR0MD=1;					//关闭 Timer0 模块
	TMR0IE=0;					//关闭 TMR0溢出中断
}

//*******************************************/
//函数名:Time1_Init
//功  能:定时器1初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void Time1_Init(void)
{
	/***************Timer1 设置****************************/
	/*作为系统节拍定时器*/
	/*16 Bit 定时器初值计算公式：X = 65536 - t /（T x P）*/
	/*X :计数初值*/
	/*t :设定定时时间*/
	/*T :指令周期（4MHZ，T=1us)*/
	/*P :分频比率*/
	/******************************************************/
	
	T1CON=0x03;					//16位定时器 TMR1使能 1:1分频
	T1GCON=0x00;				//禁止门控*/		
#if 0	
	TMR1H=0xEC; 				//Timer1初始值设定5ms---4M	
	TMR1L=0x88;
#endif
	TMR1H=0xD8; 				//Timer1初始值设定5ms---8M	
	TMR1L=0xFD;	
    			
	TMR1IE=1;					//允许TMR1溢出中断	
	TMR1MD=0;					//使能Timer1模块	
}

//*******************************************/
//函数名:Time2_Init
//功  能:定时器2初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void Time2_Init(void)
{
	T2OUTPS0 = 0;
	T2OUTPS1 = 0;
	T2OUTPS2 = 0;
	T2OUTPS3 = 0;			//输出后分频为1:1
	
	T2CKPS0  = 0;
	T2CKPS1  = 0;  			//预分频比为1	
	
	TMR2  = 0x00;			//Timer4初始值
	
	TMR2ON   = 0;  			//关闭Timer2模块
	TMR2IE   = 0;			//关闭TMR2溢出中断	
}

//*******************************************/
//函数名:Time3_Init
//功  能:定时器3初始化
//参  数:无
//返回值:无 
//时  间:20171103
//创建者:ahren
/*******************************************/
static void Time3_Init(void)
{	
	T3CON  = 0x03;			//16位定时器TMR3使能1:1分频	
	T3GCON = 0x00;			//禁止门控
		
	TMR3H  = 0x00;			//Timer3初始值
	TMR3L  = 0x00;

	TMR3MD = 0;				//关闭Timer3模块
	TMR3IE = 0;				//关闭TMR3溢出中断				
}

//*******************************************/
//函数名:Time4_Init
//功  能:定时器3初始化
//参  数:无
//返回值:无 
//时  间:20171110
//创建者:ahren
/*******************************************/
static void Time4_Init(void)
{	
	T4OUTPS0 = 0;
	T4OUTPS1 = 0;
	T4OUTPS2 = 0;
	T4OUTPS3 = 0;			//输出后分频为1:1
	
	T4CKPS0  = 0;
	T4CKPS1  = 0;  			//预分频比为1
		
	TMR4  = 0x00;			//Timer4初始值

	TMR4MD = 0;				//关闭Timer3模块
	TMR4IE = 0;				//关闭TMR3溢出中断				
}
