
/*----------------------------------------------------------------------*/
/* Confidential and Proprietary Information of MicroPerfect Corporation */
/* (C) 2017 ,MicroPerfect Corporation . All rights reserved. */
/* FileName: isr.h */
/* New File Date:2017.11.03 */
/* Function:*/
/* Ver:001 */
/* Author:MP_Ahren*/
/* History:YYYY.MM.DD Version Author Description */
/* */
/*----------------------------------------------------------------------*/


#ifndef _ISR_H_
#define	_ISR_H_

/***************头文件****************/
/**/
/*************************************/

#include"config.h"

/******************宏定义*************/
/**/
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/

extern u8 Sys_Time_Falg_g;				

/***************函数申明**************/
/**/
/*************************************/

/*************************************/

#endif
