/* 
 * File:   MCP2515_App.h
 * Author: MP-94
 *
 * Created on December 4, 2019, 11:36 AM
 */

#ifndef MCP2515_APP_H
#define	MCP2515_APP_H

/***************头文件****************/
/**/
/*************************************/
#include"config.h"

/******************宏定义*************/
/**/


/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/
extern uint32_t MCP2515_TxID;
extern u8 Get_Abnormal_Cnt;
/***************函数申明**************/
/**/
/*************************************/
void MCP2515_User_Agreement();
void MCP2515_CAN_Tx_Buffer(u8 BOX_Num, u8 *CAN_TX_Buf, u8 len,u8 Life_Signal);   
/*************************************/


#endif	/* MCP2515_APP_H */

