/* 
 * File:   MCP2515_App.h
 * Author: MP-94
 *
 * Created on December 4, 2019, 11:36 AM
 */

#ifndef MCP2515_APP_H
#define	MCP2515_APP_H

/***************头文件****************/
/**/
/*************************************/
#include"config.h"

/******************宏定义*************/
/**/

u8 Version_Data_Normal[9] = {0x01,0x00,0x02,0x00,0x13,0x0C,0x1B,0xFF,00};//软硬件版本信息
/*************************************/


/*************************************/

/***************标志位申明************/
/**/
/*************************************/


/***************函数申明**************/
/**/
/*************************************/
void MCP2515_User_Agreement(u8 Time_Flag);
void MCP2515_CAN_Tx_Buffer(u8 BOX_Num, u8 *CAN_TX_Buf, u8 len,u8 Life_Signal);   
/*************************************/


#endif	/* MCP2515_APP_H */

